
[{
    "title": "Event Accomadation and Friend Finder",
    "year": "In Progress 2025",
    "technologies": ["AWS Lambda", "AWS API Gateway", "AWS S3", "Python", "HTML", "CSS", "Javascript"],
    "description": "This project aims to match people attending events with people who need a similar accomadation together as well as make friends at the event beforehand. This project is an MVP, and is still in progress as I hope to make it a full-fledged product."
  },
  {
    "title": "The Myth of the Cheaper Generic",
    "image": "images/project1.png",
    "year": "Spring 2025",
    "technologies": ["Python", "Pandas", "Plotly"],
    "description": "This project visualizes price differences between generic and brand-name products across key categories, helping users easily compare prices and make informed decisions between 3 major U.S. supermarket chains: Walmart, WholeFoods, and Target."
  },
  {
    "title": "Persuasive or Deceptive Visualization?",
    "url": "project2.html",
    "year": "Spring 2025",
    "technologies": ["Python", "Pandas", "Plotly", "Photoshop"],
    "description": "Visualizations designed to persuade can often be misleading. This project explores how the same data can be presented to convey opposing messages, using NYPD complaint data involving White and Black civilians as a case study."
  },
  {
    "title": "Bike Watching",
    "url": "https://spattapu1.github.io/dsc106-lab7/",
    "year": "Spring 2025",
    "technologies": ["Python", "Plotly", "Mapbox", "HTML", "CSS", "JavaScript", "D3.js"],
    "repository": "https://github.com/spattapu1/dsc106-lab7",
    "description": "Bike Watching is an interactive visualization of bike arrivals and departures in Boston, built with the Mapbox API. By mapping bike activity with dynamic circle sizes, the project aims to highlight traffic patterns and support insights into urban mobility."
  }, 
  {
    "title": "The Hidden Science of Sleep",
    "url": "https://spattapu1.github.io/SleepTracker/",
    "year": "Spring 2025",
    "technologies": ["Python", "Plotly", "HTML", "CSS", "JavaScript", "D3.js"],
    "repository": "https://github.com/spattapu1/SleepTracker",
    "description": "Sleep Tracker is a website with interactive D3.js visualizations that analyzes sleep data from 22 individuals. By exploring metrics like sleep efficiency, duration, hormone levels (melatonin, cortisol), stress, emotions, and daily activity, the project aims to uncover patterns and insights that help users understand and improve their sleep habits."
  },
  {
    "title": "League of Legends Statistical Analysis",
    "url": "https://spattapu1.github.io/LoL-Statistical-Analysis/",
    "year": "Winter 2025",
    "technologies": ["Python", "Plotly", "Scikit-learn", "Pandas", "Numpy"],
    "repository": "https://github.com/spattapu1/LoL-Statistical-Analysis",
    "description":"League of Legends Statistical Analysis uses a Random Forest classifier to predict match outcomes based on in-game stats like gold, kills, damage, and objectives. The project evaluates model performance using metrics like accuracy, precision, recall, and F1 score, providing insights into the factors that influence game results."
  }
]
